--创建数据库
create database DrinkDB
go
use DrinkDB 
go
create table MessInfo                              --创建管理员表
(
MessID int primary key identity(1,1),              --管理员id
MessNum varchar(50) not null,                      --管理员账号
MessName varchar(50) not null,                     --管理员姓名
MessPwd varchar(50) not null                       --管理员密码
 )
go
--添加管理员信息
insert into MessInfo(MessNum,MessName,MessPwd) values('admin','window','123456') 
select * from MessInfo
create table UserInfo                              --创建用户表
(
UserID int primary key identity(1,1),              --用户id
UserNum varchar(50) not null,                      --用户账号
UserName varchar(50) not null,                     --用户姓名
UserPwd varchar(50) not null                       --用户密码
)
go
--添加用户信息
insert into UserInfo(UserNum,UserName,UserPwd) 
values('111','小明','111111'), ('222','小红','222222'),('333','小王','333333')

create table DrinkType                             --创建饮品类型表
(
TypeID int primary key identity(1,1),              --饮品类型id
TypeName nvarchar(50) not null                     --饮品类型名称
)
go
insert into DrinkType(TypeName) 
values ('茶'), ('酒'), ('奶茶'),('咖啡'), ('饮用水'), ('碳酸饮料'), ('茶类饮品'), ('果汁饮料'), ('果蔬汁饮料')
create table DrinkInfo                             --创建饮品信息表
(
DrinkID int primary key identity(1,1),             --饮品编号
Drinkimg nvarchar(50) not null,                    --饮品图片
DrinkName nvarchar(30) not null,                    --饮品名称
DrinkMesg nvarchar(200) not null,                    --饮品简介
Remark nvarchar(500) null,                          --备注
TypeID int foreign key references DrinkType(TypeID)  not null, --类型id
)
go
insert into DrinkInfo(Drinkimg,DrinkName,DrinkMesg,Remark,TypeID)
values
('龙井.jpeg','龙井茶','龙井茶素以色翠、形美、香郁、味醇冠绝天下，其独特的“淡而远”“香而清”的绝世神采和非凡品质，在众多茗茶中独具一格，冠列中国十大名茶之首。特级龙井茶扁平光滑挺直，色泽嫩绿光润，香气鲜嫩清高，滋味鲜爽甘醇，叶底细嫩呈朵。','龙井茶采摘有三大特点：一早，二嫩，三勤。',1),
('茅台.jpeg','茅台酒','茅台酒是白酒的一种，也是中国的传统特产酒，具有色清透明、酱香突出、醇香馥郁、幽雅细腻、入口柔绵、清冽甘爽、酒体醇厚丰满、回味悠长、空杯留香持久的特点。','茅台酒液纯净透明、醇馥幽郁的特点，是由酱香、窖底香、醇甜三大特殊风味融合而成。具有不烧喉咙、也不上头、能消除疲劳、安定精神等特点。',2),
('茶颜悦色.jpeg','茶颜悦色奶茶','茶颜悦色以茶饮和甜品为主打，茶颜悦色是长沙本土知名奶茶品牌，更是被全国奶茶爱好者所知的“网红”品牌。','根据港粤台的饮品创意奶茶店，运用复合创新思维顺势推出的最新一代立体复合型餐饮业态。',3),
('橙汁.jpeg','橙汁','是以橙子为原料经过榨汁机压榨得到的果汁饮料。橙和橘子汁中的黄酮能有效抑制乳腺癌、肺癌等细胞的增生。','经常饮用橙汁也可以有效预防某些慢性疾病、维持心肌功能以及降低血压。',8),
('枣茶.jpeg','枣茶','用红枣与茶同泡，常饮有明显的防癌、抗癌、预防心血管疾病和健脾开胃的作用。红枣与茶叶、甘草煎汤饮用，对贫血、血小板减少性紫癜、妇女更年期盗汗等均有改善作用。','',7),
('百世可乐.jpeg','百世可乐','百事可乐(英文名称Pepsi-Cola)，诞生于19世纪90年代，以碳酸水、糖、香草、生油、胃蛋白酶（pepsin）及可乐果制成，逐渐发展为美国百事公司推出的一种碳酸饮料。','百世可乐真好喝',6),
('可口可乐.jpeg','可口可乐','可口可乐以水、果葡糖浆，白砂糖、焦糖色、二氧化碳、磷酸、咖啡因、食用香料制成，主要营养成分为碳水化合物，主要食用功效：解渴，怡神','可口可乐真好喝',6),
('one.jpg','水果茶','123456','13332132132',1)
go
create table DrinkNews                             --创建饮品新闻表
(
NewsID int primary key identity(1,1),              --新闻编号
Newsimg nvarchar(50) not null,                    --新闻图片
NewsName nvarchar(200) not null,                     --新闻标题
NewsMesg nvarchar(500) not null,                  --新闻内容
NewsTime datetime default(getdate()),                       --发布时间
DrinkID int foreign key references DrinkInfo(DrinkID)  not null, --饮品编号
UserID int foreign key references UserInfo(UserID) ,    --用户id
)
go
insert into DrinkNews(Newsimg,NewsName,NewsMesg,NewsTime,DrinkID,UserID)
values
('龙井.jpeg','1234567489','4566559+59+8','2020-02-11',1,1),
('可乐争宠.jpg','纠缠百年的肥宅水大乱斗：可口vs百事，谁才是你心中真正的碳酸饮料一哥',
'可口可乐全年净收增长17%，今年涨价潮仍将持续可口可乐公司报告称，全年净收386.55亿美元，增长了17%，超出市场预期的380.8亿美元；
全年营业利润103.08亿美元，增长了15%；全年有机收入增长16%。其中，第四季度净收94.64亿美元，增长了10%，超出市场预期的89.4亿美元；营业利润16.72亿美元，下降了28%；Q4有机收入增长9%。百事公司全年净收增长12.9%，
未来可能面临“缺货”问题百事可乐报告其全年业绩显著加速，全年净收794.74亿美元，增长13%；全年营收利润111.62亿美元，增长11%；全年净利润76.79亿美元，增长7%；全年有机增长10%。其中第四季度净收为252.48亿美元，
增长12%；营业利润25.62亿美元，降低9%；净利润13.41亿美元，降低28%；有机增长12%。'
,'2022-04-22',7,2),
('茅台利润.jpeg','超预期！茅台一季度净赚超170亿，同比大增24%，股价大涨近4%…北向资金4月逆势低吸',
'4月26日晚间，贵州茅台披露2022年第一季度报告，一季报显示，公司营业收入322.96亿元，同比增长18.43％，实现净利润172.45亿元，同比增长23.58％；基本每股收益13.73元/股。4月27日，两市大幅震荡，贵州茅台逆势高开2%，
随后继续强势上涨，盘中一度涨超4%，截至发稿，涨3.97%。4月以来，北向资金逆势增持茅台超42亿元。一季度基金重仓股也显示，一季度末持有贵州茅台的基金数则为1796只。4月26日晚间，贵州茅台披露2022年第一季度报告，一
季度公司营业收入322.96亿元，同比增长18.43％，实现净利润172.45亿元，同比增长23.58％；基本每股收益13.73元/股。其中，茅台酒收入为288.6亿元，系列酒收入为34.28亿元。'
,'2022-04-11',2,3),
('枣茶暖人心.jpg','一杯枣茶，温暖金昌市防疫战线的工作人员',
'掌上兰州·兰州晨报讯（记者董开炜）面对突如其来的疫情，金昌市大爱无疆公益协会的志愿者们以实际行动参与到全民疫情防控工作中。连日来，该公益协会采取自筹红糖、大枣、枸杞等配料，熬制枣茶，每天在清晨7时以后和晚上8时以后，
分两次将枣茶送到金昌市的防疫执勤点。一杯杯枣茶，不仅为防疫工作人员驱寒增暖，也向工作人员献上了全市老百姓对他们最真挚的问候、最温暖的关怀和最崇高的敬意！金昌市大爱无疆公益协会志愿者向防疫工作人员分送枣茶；在坚持向
防疫工作人员送上枣茶的同时，金昌市大爱无疆公益协会还分组安排志愿者，将用于防疫的消毒液及方便面、酸辣粉、红糖、大枣、生姜等慰问品送往永昌南坝等监测点。金昌市大爱无疆公益协会筹集的防疫物资。'
,'2020-02-11',5,2),
('龙井.jpeg','1234567489','4566559+59+8','2020-02-11',1,1),
('龙井.jpeg','1234567489','4566559+59+8','2020-02-11',1,1),
('龙井.jpeg','1234567489','4566559+59+8','2020-02-11',1,1)
go
select * from DrinkNews